{"data": "The 20 rules of formulating knowledge (concise)\n\nPremise\n- Learning speed depends heavily on how you formulate what you study. Assume you’re using spaced repetition.\n\nCore rules\n1) Don’t learn what you don’t understand\n- First ensure comprehension; cramming without understanding is slow and brittle.\n\n2) Learn before you memorize\n- Build a simple big-picture model first; then memorize details.\n\n3) Build on basics\n- Secure foundational facts; they’re cheap to retain and make new material stick.\n\n4) Minimum information principle\n- One fact per item. Short question, shorter answer. Split complex facts.\n\n5) Use cloze deletions\n- Turn sentences into fill‑in‑the‑blank items to quickly produce simple prompts.\n\n6) Use imagery\n- Prefer diagrams and maps where possible; pictures stick better than words.\n\n7) Use mnemonic techniques\n- Pegs, stories, and mind maps help with hard-to-remember items and numbers.\n\n8) Graphic deletions\n- Cover parts of an image and recall what’s hidden (great for anatomy, geography).\n\n9) Avoid sets\n- Unordered lists are hard; convert to meaningful, ordered sequences or smaller chunks.\n\n10) Avoid enumerations\n- If unavoidable, learn with overlapping cloze deletions or grouped chunks.\n\n11) Combat interference\n- Make items unambiguous, split similar facts, add cues/examples to distinguish look‑alikes.\n\n12) Optimize wording\n- Remove fluff. Keep only what’s needed to trigger the right answer fast.\n\n13) Refer to other memories\n- Tie new facts to known concepts to reduce ambiguity and speed recall.\n\n14) Personalize and give examples\n- Link to your own experiences; concrete, personal cues cut interference.\n\n15) Use emotion\n- Vivid, emotional cues boost recall (without overusing them).\n\n16) Use context cues\n- Labels/categories/templates set the frame and reduce confusion (e.g., “bioch: GRE”).\n\n17) Redundancy can help\n- Multiple simple views of the same fact (active/passive, steps, synonyms) improve retention.\n\n18) Record sources\n- Note where a fact came from to resolve conflicts and update reliably.\n\n19) Date-stamp volatile facts\n- Tag figures/versions so you know when to refresh or replace them.\n\n20) Prioritize\n- You can’t learn everything; choose sources, extract what matters, set higher retention for high‑value items, and revisit/rewrite or delete low‑value ones.\n\nQuick application checklist\n- Stuck item? Split it; make Q shorter and A minimal.\n- Similar items clash? Add disambiguating context, examples, or images.\n- Long text? Convert to multiple clozes; avoid full-paragraph memorization.\n- Lists? Order them, group them, or use overlapping clozes.\n- Valuable concept? Store it from multiple angles and include reasoning steps.\n- Add source and date for facts likely to change.\n- Reprioritize regularly: improve, reschedule, or delete weak or low-value items."}