{"data": "Concise guide: 20 rules for concise, high-value knowledge formulation (for spaced repetition learning)\n\nAssumptions\n- Learn with spaced repetition (e.g., SuperMemo).\n- The goal is simple, well-structured knowledge that can be recalled quickly and reliably.\n\nThe 20 rules\n\n1) Do not learn if you do not understand\nUnderstand the material first; avoid blind memorization of incomprehensible content.\n\n2) Learn before you memorize\nBuild an overall, coherent picture first; only then memorize details as parts of that structure.\n\n3) Build upon the basics\nStart with simple, core concepts. You can expand later; basics are cheap to memorize and crucial.\n\n4) Stick to the minimum information principle\nKeep items simple and precise. If needed, split complex topics into smaller sub-items.\n\n5) Cloze deletion is easy and effective\nUse fill-in-the-blank cloze items to convert material for spaced repetition; great for beginners and advanced users.\n\n6) Use imagery\nLeverage visuals when beneficial; images and mind maps can reduce learning time and aid retention.\n\n7) Use mnemonic techniques\nApply mnemonics where helpful, but recognize that long-term retention hinges on repeated, well-structured practice.\n\n8) Graphic deletion is as good as cloze deletion\nMissing parts of an image can yield multiple valid recall items; especially useful in visuals-heavy subjects.\n\n9) Avoid sets\nSets are hard to memorize. If necessary, convert to enumerations or break into meaningful sub-items; use targeted clustering to reduce interference.\n\n10) Avoid enumerations\nIf you must use enumerations, employ methods like overlapping cloze deletions or grouping to simplify recall.\n\n11) Combat interference\nInterference between similar items is a major cause of forgetting. Make items unambiguous, minimize overlap, and review hard items to reduce interference.\n\n12) Optimize wording\nUse concise, precise wording. Remove unnecessary phrases; place contextual hints in parentheses if needed.\n\n13) Refer to other memories\nConnect new material to existing memories to reduce interference and improve recall.\n\n14) Personalize and provide examples\nUse personal, relatable examples to anchor memory and reduce interference.\n\n15) Rely on emotional states\nVivid, emotionally engaging examples can improve recall—but use them judiciously.\n\n16) Context cues simplify wording\nUse prefixes, labels, or context tags to clarify meaning and reduce repetition, e.g., bioch:, math:, etc.\n\n17) Redundancy does not contradict the principle\nSome redundancy (multiple representations, derivation steps, etc.) can improve recall if it serves understanding and retrieval.\n\n18) Provide sources\nNote sources for reliability and future verification; sources accompany items but aren’t part of the learned content.\n\n19) Provide date stamping\nTime-sensitive knowledge should be stamped or tagged to indicate obsolescence and guide updates.\n\n20) Prioritize\nDecide what matters most, extract essential knowledge, and adjust focus, ordering, and review strategies accordingly (including whether to import vs. formulate items).\n\nIf you’d like, I can apply these rules to a specific topic and produce a concise, well-formulated set of items ready for spaced repetition."}